app/Http/ViewComposers/StapleData.php

    public function compose(View $view){
        $authenticated_User = Auth::user();
        $category = Category::pluck('category_Menu');
        $popularTags = Tag::withCount('posts')->orderByDesc('posts_count')->take(14)->get();
        $user = User::all();
---
SELECT `category_Menu` FROM `categories`
SELECT * FROM `users`