app/Http/Controllers/AjaxController.php

SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6 offset 6
---
    public function loadMoreData(Request $request)
    {
        if($request->ajax()){
            $allCards = Posts::orderBy('created_at', 'desc')->skip($request->input('count'))->limit(6)->get();

SELECT * FROM `posts` WHERE `posts`.`id` = '201' LIMIT 1
SELECT count(*) as aggregate FROM `actions` inner join `posts_action` on `actions`.`id` = `posts_action`.`actions_id` WHERE `posts_action`.`posts_id` = 201 and `posts_action`.`actions_id` = 1
SELECT * FROM `users` WHERE `id` = 1 LIMIT 1
SELECT * FROM `posts` WHERE `posts`.`id` = '263' LIMIT 1
---
    public function incrementDecrement(Request $request)
    {
        $id  = $request->input('postId');
        $post = Posts::findOrFail($id);
        $loggedUser = Auth::user()->id;
        //Duplicate Check
        if (!$post->filterActions(1, $id, $loggedUser)->isEmpty() && $request->input('value') == "true") {
            return response()->json(['success' => true, 'action' => $request->input('action'), 'Message' => "Entry Exists"]);
        } else if (!$post->filterActions(2, $id, $loggedUser)->isEmpty() && $request->input('value') == "true") {
            return response()->json(['success' => true, 'action' => $request->input('action'), 'Message' => "Entry Exists 2nd"]);
        }
        else {
            if ($request->input('action') == "like") {
                if ($request->input('value') == "true") {
                    $post->actionPosts()->attach(1, ['posts_id' => $post->id, 'users_id' => $loggedUser]);
                    return response()->json(['success' => true, 'action' => $request->input('action'), 'count' => $post->likeCount()->count(), 'Message' => "Attached"]);
                } else {
                    $test = $post->actionPosts()->wherePivot('actions_id', '=', 1)->wherePivot('posts_id', '=', $post->id)->wherePivot('users_id', '=', $loggedUser)->detach();
                    return response()->json(['success' => true, 'action' => $request->input('action'), 'count' => $post->likeCount()->count(),  'Message' => "Detached"]);
                }
            } elseif ($request->input('action') == "dislike") {
                if ($request->input('value') == "true") {
                    $post->actionPosts()->attach(2, ['posts_id' => $post->id, 'users_id' => $loggedUser]);
                    return response()->json(['success' => true, 'action' => $request->input('action'), 'count' => $post->dislikeCount()->count(), 'Message' => "Attached"]);
                } else {
                    $post->actionPosts()->wherePivot('actions_id', '=', 2)->wherePivot('posts_id', '=', $post->id)->wherePivot('users_id', '=', $loggedUser)->detach();
                    return response()->json(['success' => true, 'action' => $request->input('action'), 'count' => $post->dislikeCount()->count(), 'Message' => "Detached"]);

INSERT INTO `comments` (`comment`, `posts_id`, `users_id`, `updated_at`, `created_at`) VALUES ('Id error esse perspiciatis iusto facere. Occaecati nihil quam quos sed aspernatur sequi qui beatae. Corrupti sapiente aut voluptatem qui maiores reprehenderit.', '263', 1, '2022-07-24 09:36:45', '2022-07-24 09:36:45')
SELECT * FROM `comments` WHERE `comments`.`posts_id` = 263 and `comments`.`posts_id` IS not NULL ORDER BY `created_at` DESC
---
    public function commentsSave(Request $request){
        if($request->ajax()){
             $post = Posts::findOrFail($request->input('postId'));
              $comment = Comments::create([
                  'comment' =>  $request->input('formData'),
                  'posts_id' => $request->input('postId'),
                  'users_id' =>  Auth::user()->id,
              ]);

            $posts = Posts::find($request->input('postId'));
            $comments = $posts->comments()->LatestComments()->get();