app/Http/Controllers/Controller.php

SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6
---
    public function index(){
        Cache::forget('Index');
        $data = Posts::orderBy('created_at', 'desc')->take(6)->get();

SELECT * FROM `categories` WHERE `categories`.`posts_id` in (3, 7, 12, 14, 27, 28, 31, 34, 39, 44, 46, 49, 50, 56, 61, 62, 63, 68, 69, 72, 73, 77, 79, 80, 82, 83, 85, 100, 105, 108, 110, 112, 114, 115, 116, 117, 118, 120, 121, 123, 126, 132, 134, 135, 136, 141, 145, 151, 155, 156, 158, 160, 164, 171, 173, 177, 179, 182, 185, 187, 193, 196, 197, 198, 201, 205, 213, 219, 227, 228, 230, 232, 234, 242, 243, 245, 248, 249, 252, 253, 261, 267, 273, 278, 279, 282, 284, 285, 294)
SELECT * FROM `posts` WHERE exists (SELECT * FROM `categories` WHERE `posts`.`id` = `categories`.`posts_id` and `category_Menu` like '%Food%')
---
    public function category($category){
        $categoryCards =  Posts::whereHas('category', function($query) use($category) {$query->where('category_Menu', 'like', '%'.$category.'%');})->with('category')->get();

SELECT * FROM `posts` WHERE `users_id` = 1 and `title` LIKE '%test%'
SELECT * FROM `posts` WHERE `users_id` = 1
---
    public function userDashData(Request $request){
        $search_Parameter = $request->input('value') ?? "";
        $profile = clock(Auth::user());
        $userData = Posts::where('users_id', '=', $profile->id);
        if($search_Parameter != ""){
            $findIt = $userData->where('title', 'LIKE', '%'.$search_Parameter.'%')->get();
            $findPosts = compact('profile', 'findIt', 'search_Parameter');
            $html = view('components.dashboard.dashTableSearch')->with(compact('findPosts'))->render();
            return response()->json(['success'=>true, 'findPosts', 'value' => $search_Parameter, $findPosts, 'search_Data' => $html]);
        }
        else{
            $findIt = Posts::where('users_id', '=', $profile->id)->get();