app/Http/Controllers/PostsController.php

    public function index()
    {
        $posts =  Cache::remember('index-postsData', now()->addMinutes(10), function () {
            return Posts::with(['comments' => function ($query) {
                return $query->LatestComments();
            }])->take(6)->get();
---
SELECT * FROM `comments` WHERE `comments`.`posts_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 294, 295, 296, 297, 298, 299, 300) ORDER BY `created_at` DESC
SELECT * FROM `posts`

    public function show($id)
    {
        $post = Posts::findOrFail($id);
        $findName = $post->users_id;
        $comments = $post->comments()->LatestComments()->get();
---
SELECT * FROM `posts` WHERE `posts`.`id` = '199' LIMIT 1
SELECT * FROM `comments` WHERE `comments`.`posts_id` = 199 and `comments`.`posts_id` IS not NULL ORDER BY `created_at` DESC
SELECT `name` FROM `users` WHERE `id` = 12

    public function edit(Request $request, $id)
    {
        if ($request->ajax()) {
            $id = $request->input('id');
            $post = Posts::findOrFail($id);
---
SELECT * FROM `posts` WHERE `posts`.`id` = '12' LIMIT 1

    public function update(StorePost $request, $id)
    {

        if ($request->ajax()) {
            //POST UPDATE
            $validate  = $request->validated();
            $post = Posts::findOrFail($request->input('posts_id'));
            $idGet = decrypt($request->input('users_id'));
            if ($idGet != Auth::id()) {
                abort(404);
            }
            $post->fill([
                'title' => $request->title,
                'content' => $request->content,
                'users_id' => $idGet,
            ]);
            $post->save();
            //CATEGORY UPDATE
            if($request->category_Menu){
                $category = $post->category()->updateOrCreate(['posts_id' => $post->id],['category_Menu' => $request->category_Menu]);
                $test = "updated";
            }
            // IMAGE UPDATE
            if ($request->hasFile('postImage')) {
                $file = $request->file('postImage')->storeAs('Thumbnails', $post->id . "-" . $idGet . "-thumbnail." . $request->file('postImage')->extension());
                $post->media()->save(Media::updateOrCreate(['posts_id'=>$post->id],['path' => $file]));
---
SELECT * FROM `posts` WHERE `posts`.`id` = '8' LIMIT 1
SELECT * FROM `media` WHERE (`posts_id` = 8) LIMIT 1

    public function destroy(Request $request, $id)
    {
        if ($request->ajax()) {
            $id = $request->input('id');
            $deletePost = Posts::findOrFail($id);
            $deletePost->category()->delete();
            $deletePost->comments()->delete();
---
SELECT * FROM `posts` WHERE `posts`.`id` = '171' LIMIT 1
DELETE FROM `categories` WHERE `categories`.`posts_id` = 171 and `categories`.`posts_id` IS not NULL
DELETE FROM `posts` WHERE `id` = 171
DELETE FROM `comments` WHERE `comments`.`posts_id` = 171 and `comments`.`posts_id` IS not NULL