app/Models/Posts.php

DELETE FROM `comments` WHERE `comments`.`posts_id` = 171 and `comments`.`posts_id` IS not NULL
DELETE `actions` FROM `actions` inner join `posts_action` on `actions`.`id` = `posts_action`.`actions_id` WHERE `posts_action`.`posts_id` = 171
DELETE FROM `media` WHERE `media`.`posts_id` = 171 and `media`.`posts_id` IS not NULL
---
    public static function boot()
    {
        parent::boot();

        // static::addGlobalScope(new sortByLatest);

        static::deleting(function(Posts $posts){
            $posts->comments()->delete();
        });

        static::deleting(function(Posts $posts){
            $posts->actionPosts()->delete();
        });

        static::deleting(function(Posts $posts){
            $posts->media()->delete();

SELECT `actions`.*, `posts_action`.`posts_id` as `pivot_posts_id`, `posts_action`.`actions_id` as `pivot_actions_id`, `posts_action`.`created_at` as `pivot_created_at`, `posts_action`.`updated_at` as `pivot_updated_at` FROM `actions` inner join `posts_action` on `actions`.`id` = `posts_action`.`actions_id` WHERE `posts_action`.`posts_id` = 201 and `posts_action`.`actions_id` = 1 and `posts_action`.`posts_id` = '201' and `posts_action`.`users_id` = 1
---
    public function filterActions($action, $post, $user){
        return $this->actionPosts()->wherePivot('actions_id','=', $action)->wherePivot('posts_id','=', $post)->wherePivot('users_id','=', $user)->get();